particle-iot/device-os/hal/src/rtl872x/ble_hal.cpp
int BleGap::handleAuthenStateChanged(uint8_t connHandle, uint8_t state, uint16_t cause) {
    LOG_DEBUG(TRACE, "handleAuthenStateChanged: handle: %d, cause: 0x%x", connHandle, cause);
    BleConnection* connection = fetchConnection(connHandle);
    CHECK_TRUE(connection, SYSTEM_ERROR_NOT_FOUND);
    switch (state) {
        case GAP_AUTHEN_STATE_STARTED: {
            LOG_DEBUG(TRACE, "GAP_AUTHEN_STATE_STARTED");
            auto state = connection->pairState;
            connection->pairState = BLE_PAIRING_STATE_STARTED;
            // Notify the event only if the other side initiates the pairing procedure
            if (state == BLE_PAIRING_STATE_NOT_INITIATED || state == BLE_PAIRING_STATE_REJECTED) {
                hal_ble_link_evt_t linkEvent = {};
                linkEvent.type = BLE_EVT_PAIRING_REQUEST_RECEIVED;
                linkEvent.conn_handle = connHandle;
                // User may call rejectPairing() in the event handler
                notifyLinkEvent(linkEvent);
            }
            break;
        }
        case GAP_AUTHEN_STATE_COMPLETE: {
            hal_ble_link_evt_t linkEvent = {};
            linkEvent.type = BLE_EVT_PAIRING_STATUS_UPDATED;
            linkEvent.conn_handle = connection->info.conn_handle;
            linkEvent.params.pairing_status.bonded = 0;
            linkEvent.params.pairing_status.lesc = 0;
            if (cause == GAP_SUCCESS) {
                LOG_DEBUG(TRACE, "GAP_AUTHEN_STATE_COMPLETE pair success");
                connection->pairState = BLE_PAIRING_STATE_PAIRED;
                T_GAP_SEC_LEVEL secType = GAP_SEC_LEVEL_NO;
                // FIXME: This API doesn't work as expected for now
                int ret = le_bond_get_sec_level(connHandle, &secType);
                LOG(TRACE, "handle: %d, ret: %d, secType: %04X", connHandle, ret, secType);
                linkEvent.params.pairing_status.lesc = (secType == GAP_SEC_LEVEL_SC_UNAUTHEN || secType == GAP_SEC_LEVEL_SC_AUTHEN);
                linkEvent.params.pairing_status.status = SYSTEM_ERROR_NONE;
            } else {
                LOG_DEBUG(TRACE, "GAP_AUTHEN_STATE_COMPLETE pair failed");
                connection->pairState = BLE_PAIRING_STATE_REJECTED;
                linkEvent.params.pairing_status.status = SYSTEM_ERROR_INTERNAL;
            }
            notifyLinkEvent(linkEvent);
            break;
        }
        default: {
            LOG_DEBUG(TRACE, "unknown newstate %d", state);
            break;
        }
    }
    return SYSTEM_ERROR_NONE;
}

int BleGap::handlePairJustWork(uint8_t connHandle) {
    BleConnection* connection = fetchConnection(connHandle);
    if (connection && connection->pairState == BLE_PAIRING_STATE_STARTED) {
        CHECK_RTL(le_bond_just_work_confirm(connHandle, GAP_CFM_CAUSE_ACCEPT));
    } else {
        CHECK_RTL(le_bond_just_work_confirm(connHandle, GAP_CFM_CAUSE_REJECT));
    }
    return SYSTEM_ERROR_NONE;
}

int BleGap::handlePairPasskeyDisplay(uint8_t connHandle, bool displayOnly) {
    BleConnection* connection = fetchConnection(connHandle);
    if (connection && connection->pairState == BLE_PAIRING_STATE_STARTED) {
        uint32_t displayValue = 0;
        le_bond_get_display_key(connHandle, &displayValue);
        char passkey[BLE_PAIRING_PASSKEY_LEN + 1];
        sprintf(passkey, "%06ld", displayValue);
        hal_ble_link_evt_t linkEvent = {};
        if (displayOnly) {
            linkEvent.type = BLE_EVT_PAIRING_PASSKEY_DISPLAY;
        } else {
            linkEvent.type = BLE_EVT_PAIRING_NUMERIC_COMPARISON;
        }
        linkEvent.conn_handle = connHandle;
        linkEvent.params.passkey_display.passkey = (const uint8_t*)passkey;
        // User may call rejectPairing() in the event handler
        notifyLinkEvent(linkEvent);
        if (connection->pairState == BLE_PAIRING_STATE_USER_REQ_REJECT) {
            goto reject;
        }
        if (displayOnly) {
            le_bond_passkey_display_confirm(connHandle, GAP_CFM_CAUSE_ACCEPT);
        } else if (connection->pairState != BLE_PAIRING_STATE_SET_AUTH_DATA) {
            // User didn't set authentication data in event callback, reject pairing automatically
            goto reject;
        }
        return SYSTEM_ERROR_NONE;
    }

reject:
    if (displayOnly) {
        CHECK_RTL(le_bond_passkey_display_confirm(connHandle, GAP_CFM_CAUSE_REJECT));
    } else {
        CHECK_RTL(le_bond_user_confirm(connHandle, GAP_CFM_CAUSE_REJECT));
    }
    return SYSTEM_ERROR_NONE;
}

int BleGap::handlePairPasskeyInput(uint8_t connHandle) {
    BleConnection* connection = fetchConnection(connHandle);
    if (connection && connection->pairState == BLE_PAIRING_STATE_STARTED) {
        hal_ble_link_evt_t linkEvent = {};
        linkEvent.type = BLE_EVT_PAIRING_PASSKEY_INPUT;
        linkEvent.conn_handle = connHandle;
        notifyLinkEvent(linkEvent);
        if (connection->pairState == BLE_PAIRING_STATE_SET_AUTH_DATA) {
            return SYSTEM_ERROR_NONE;
        }
    }
    CHECK_RTL(le_bond_passkey_input_confirm(connHandle, 0, GAP_CFM_CAUSE_REJECT));
    return SYSTEM_ERROR_NONE;
}

T_APP_RESULT BleGap::gapEventCallback(uint8_t type, void *data) {
    T_APP_RESULT result = APP_RESULT_SUCCESS;
#ifdef DEBUG_BUILD
    T_LE_CB_DATA *p_data = (T_LE_CB_DATA *)data;
#endif
    switch (type) {
#if F_BT_LE_4_2_DATA_LEN_EXT_SUPPORT
        case GAP_MSG_LE_DATA_LEN_CHANGE_INFO: {
            LOG_DEBUG(TRACE, "gapEventCallback: GAP_MSG_LE_DATA_LEN_CHANGE_INFO, handle: %d, tx_octets: %d, max_tx_time: %d",
                            p_data->p_le_data_len_change_info->conn_id,
                            p_data->p_le_data_len_change_info->max_tx_octets,
                            p_data->p_le_data_len_change_info->max_tx_time);
            break;
        }
#endif
        case GAP_MSG_LE_MODIFY_WHITE_LIST: {
            LOG_DEBUG(TRACE, "gapEventCallback: GAP_MSG_LE_MODIFY_WHITE_LIST, operation %d, cause 0x%x",
                            p_data->p_le_modify_white_list_rsp->operation, p_data->p_le_modify_white_list_rsp->cause);
            break;
        }
        case GAP_MSG_LE_SCAN_INFO: {
            LOG_DEBUG(TRACE, "gapEventCallback, GAP_MSG_LE_SCAN_INFO");
            BleGap::getInstance().notifyScanResult(((T_LE_CB_DATA *)data)->p_le_scan_info);
            break;
        }
        default: {
            LOG_DEBUG(TRACE, "gapEventCallback: unhandled type 0x%x", type);
            break;
        }
    }
    return result;
}

