particle-iot/device-os/hal/src/rtl872x/ble_hal.cpp
void BleGatt::onDiscoverStateCallback(uint8_t connHandle, T_DISCOVERY_STATE discoveryState) {
    if (!BleGap::getInstance().valid(connHandle)) {
        return;
    }
    auto& gatt = BleGatt::getInstance();
    if (!gatt.isDiscovering_ || gatt.currDiscConnHandle_ != connHandle) {
        return;
    }
    switch (discoveryState) {
        case DISC_STATE_SRV_DONE: {
            gatt.isDiscovering_ = false;
            if (gatt.discSvcCallback_) {
                hal_ble_svc_discovered_evt_t svcDiscEvent = {};
                svcDiscEvent.conn_handle = gatt.currDiscConnHandle_;
                svcDiscEvent.count = gatt.discServices_.size();
                svcDiscEvent.services = gatt.discServices_.data();
                gatt.discSvcCallback_(&svcDiscEvent, gatt.discSvcContext_);
            }
            os_semaphore_give(gatt.discoverySemaphore_, false);
            break;
        }
        case DISC_STATE_CHAR_DONE:
        case DISC_STATE_CHAR_UUID16_DONE:
        case DISC_STATE_CHAR_UUID128_DONE: {
            // Start discovering descriptors
            if (client_all_char_descriptor_discovery(connHandle, gatt.clientId_, gatt.currDiscService_->start_handle, gatt.currDiscService_->end_handle) != GAP_CAUSE_SUCCESS) {
                LOG(ERROR, "Imcompleted characteristic discovery procedure!");
                gatt.isDiscovering_ = false;
                os_semaphore_give(gatt.discoverySemaphore_, false);
            }
            break;
        }
        case DISC_STATE_CHAR_DESCRIPTOR_DONE: {
            // Characteristic discovery procedure completed
            gatt.isDiscovering_ = false;
            if (gatt.discCharCallback_) {
                hal_ble_char_discovered_evt_t charDiscEvent = {};
                charDiscEvent.conn_handle = gatt.currDiscConnHandle_;
                charDiscEvent.count = gatt.discCharacteristics_.size();
                charDiscEvent.characteristics = gatt.discCharacteristics_.data();
                gatt.discCharCallback_(&charDiscEvent, gatt.discCharContext_);
            }
            os_semaphore_give(gatt.discoverySemaphore_, false);
            break;
        }
        case DISC_STATE_FAILED: {
            if (gatt.isDiscovering_) {
                gatt.isDiscovering_ = false;
                os_semaphore_give(gatt.discoverySemaphore_, false);
            }
            break;
        }
        default: {
            LOG_DEBUG(TRACE, "Unhandled discover state");
            break;
        }
    }
}

void BleGatt::onDiscoverResultCallback(uint8_t connHandle, T_DISCOVERY_RESULT_TYPE type, T_DISCOVERY_RESULT_DATA data) {
    if (!BleGap::getInstance().valid(connHandle)) {
        return;
    }
    auto& gatt = BleGatt::getInstance();
    if (!gatt.isDiscovering_ || gatt.currDiscConnHandle_ != connHandle) {
        return;
    }
    switch (type) {
        case DISC_RESULT_ALL_SRV_UUID16:
        case DISC_RESULT_ALL_SRV_UUID128:
        case DISC_RESULT_SRV_DATA: {
            hal_ble_svc_t service = {};
            service.version = BLE_API_VERSION;
            service.size = sizeof(hal_ble_svc_t);
            service.start_handle = data.p_srv_uuid16_disc_data->att_handle; // memory layout is compatible with other type of calback data
            service.end_handle = data.p_srv_uuid16_disc_data->end_group_handle; // memory layout is compatible with other type of calback data
            if (type == DISC_RESULT_ALL_SRV_UUID16) {
                service.uuid.type = BLE_UUID_TYPE_16BIT;
                service.uuid.uuid16 = data.p_srv_uuid16_disc_data->uuid16;
            } else if (type == DISC_RESULT_ALL_SRV_UUID128) {
                service.uuid.type = BLE_UUID_TYPE_128BIT;
                memcpy(service.uuid.uuid128, data.p_srv_uuid128_disc_data->uuid128, BLE_SIG_UUID_128BIT_LEN);
            } else {
                service.uuid = *(gatt.discSvcUuid_);
            }
            if (!gatt.discServices_.append(service)) {
                LOG(ERROR, "Failed to append discovered service.");
                // Do nothing. We'll give the semaphore in the discover state callback
            }
            break;
        }
        case DISC_RESULT_CHAR_UUID16:
        case DISC_RESULT_CHAR_UUID128:
        case DISC_RESULT_BY_UUID16_CHAR:
        case DISC_RESULT_BY_UUID128_CHAR: {
            hal_ble_char_t characteristic = {};
            characteristic.version = BLE_API_VERSION;
            characteristic.size = sizeof(hal_ble_char_t);
            characteristic.charHandles.version = BLE_API_VERSION;
            characteristic.charHandles.size = sizeof(hal_ble_char_handles_t);
            characteristic.char_ext_props = data.p_char_uuid16_disc_data->properties & 0x80 ? 0x01 : 0x00; // memory layout is compatible with other type of calback data
            characteristic.properties = data.p_char_uuid16_disc_data->properties & 0x7F; // memory layout is compatible with other type of calback data
            characteristic.charHandles.decl_handle = data.p_char_uuid16_disc_data->decl_handle; // memory layout is compatible with other type of calback data
            characteristic.charHandles.value_handle = data.p_char_uuid16_disc_data->value_handle; // memory layout is compatible with other type of calback data
            if (type == DISC_RESULT_CHAR_UUID16 || type == DISC_RESULT_BY_UUID16_CHAR) {
                characteristic.uuid.type = BLE_UUID_TYPE_16BIT;
                characteristic.uuid.uuid16 = data.p_char_uuid16_disc_data->uuid16;
            } else {
                characteristic.uuid.type = BLE_UUID_TYPE_128BIT;
                memcpy(characteristic.uuid.uuid128, data.p_char_uuid128_disc_data->uuid128, BLE_SIG_UUID_128BIT_LEN);
            }
            if (!gatt.discCharacteristics_.append(characteristic)) {
                LOG(ERROR, "Failed to append discovered characteristic.");
                // Do nothing. We'll give the semaphore in the discover state callback
            }
            break;
        }
        case DISC_RESULT_CHAR_DESC_UUID16: {
            auto descriptor = (T_GATT_CHARACT_DESC_ELEM16*)data.p_char_desc_uuid16_disc_data;
            hal_ble_char_t* characteristic = gatt.findDiscoveredCharacteristic(descriptor->handle);
            if (!characteristic) {
                return;
            }
            if (descriptor->uuid16 == BLE_SIG_UUID_CHAR_USER_DESCRIPTION_DESC) {
                characteristic->charHandles.user_desc_handle = descriptor->handle;
            } else if (descriptor->uuid16 == BLE_SIG_UUID_CLIENT_CHAR_CONFIG_DESC) {
                characteristic->charHandles.cccd_handle = descriptor->handle;
            } else if (descriptor->uuid16 == BLE_SIG_UUID_SERVER_CHAR_CONFIG_DESC) {
                characteristic->charHandles.sccd_handle = descriptor->handle;
            }
            // Disregard any other descriptors
            break;
        }
        default: {
            LOG_DEBUG(TRACE, "Unhandled discover result");
            break;
        }
    }
}

void BleGatt::onReadResultCallback(uint8_t connHandle, uint16_t cause, uint16_t handle, uint16_t size, uint8_t *value) {
    if (!BleGap::getInstance().valid(connHandle)) {
        return;
    }
    auto& gatt = BleGatt::getInstance();
    if (gatt.currReadConnHandle_ != connHandle || gatt.readAttrHandle_ != handle) {
        return;
    }
    gatt.readLen_ = std::min(gatt.readLen_, (size_t)size);
    memcpy(gatt.readBuf_, value, gatt.readLen_);
    os_semaphore_give(gatt.readSemaphore_, false);
}

void BleGatt::onWriteResultCallback(uint8_t connHandle, T_GATT_WRITE_TYPE type, uint16_t handle, uint16_t cause, uint8_t credits) {
    if (!BleGap::getInstance().valid(connHandle)) {
        return;
    }
    auto& gatt = BleGatt::getInstance();
    if (gatt.currWriteConnHandle_ != connHandle || gatt.writeAttrHandle_ != handle) {
        return;
    }
    os_semaphore_give(gatt.writeSemaphore_, false);
}

T_APP_RESULT BleGatt::onNotifyIndResultCallback(uint8_t connHandle, bool notify, uint16_t handle, uint16_t size, uint8_t *value) {
    if (!BleGap::getInstance().valid(connHandle)) {
        return APP_RESULT_REJECT;
    }
    auto& gatt = BleGatt::getInstance();
    if (!notify) {
        if (client_attr_ind_confirm(connHandle) != GAP_CAUSE_SUCCESS) {
            LOG(ERROR, "Failed to confirm indication!");
        }
    }
    hal_ble_char_evt_t charEvent = {};
    charEvent.conn_handle = connHandle;
    charEvent.attr_handle = handle;
    charEvent.type = BLE_EVT_DATA_NOTIFIED;
    charEvent.params.data_written.offset = 0;
    charEvent.params.data_written.len = size;
    charEvent.params.data_written.data = value;
    for (const auto& publisher : gatt.publishers_) {
        if (publisher.connHandle == connHandle && publisher.valueHandle == handle) {
            if (publisher.callback) {
                publisher.callback(&charEvent, publisher.context);
            }
            break;
        }
    }
    return APP_RESULT_SUCCESS;
}

void BleGatt::onGattClientDisconnectCallback(uint8_t connHandle) {
    if (!BleGap::getInstance().valid(connHandle)) {
        return;
    }
    auto& gatt = BleGatt::getInstance();
    if (gatt.isDiscovering_) {
        os_semaphore_give(gatt.discoverySemaphore_, false);
    }
    if (gatt.currWriteConnHandle_ != BLE_INVALID_CONN_HANDLE) {
        os_semaphore_give(gatt.writeSemaphore_, false);
    }
    if (gatt.currReadConnHandle_ != BLE_INVALID_CONN_HANDLE) {
        os_semaphore_give(gatt.readSemaphore_, false);
    }
}

bool BleGatt::discovering(hal_ble_conn_handle_t connHandle) const {
    // TODO: discovering service and characteristic on multi-links concurrently.
    return isDiscovering_;
}

void BleGatt::resetDiscoveryState() {
    isDiscovering_ = false;
    currDiscConnHandle_ = BLE_INVALID_CONN_HANDLE;
    currDiscService_ = nullptr;
    discSvcUuid_ = nullptr;
    discServices_.clear();
    discCharacteristics_.clear();
}

hal_ble_char_t* BleGatt::findDiscoveredCharacteristic(hal_ble_attr_handle_t attrHandle) {
    hal_ble_char_t* foundChar = nullptr;
    hal_ble_attr_handle_t foundCharDeclHandle = BLE_INVALID_ATTR_HANDLE;
    for (auto& characteristic : discCharacteristics_) {
        // The attribute handles increase by sequence.
        if (attrHandle >= characteristic.charHandles.decl_handle) {
            if (characteristic.charHandles.decl_handle > foundCharDeclHandle) {
                foundChar = &characteristic;
                foundCharDeclHandle = characteristic.charHandles.decl_handle;
            }
        }
    }
    return foundChar;
}

int BleGatt::discoverServices(hal_ble_conn_handle_t connHandle, const hal_ble_uuid_t* uuid, hal_ble_on_disc_service_cb_t callback, void* context) {
    CHECK_TRUE(BleGap::getInstance().valid(connHandle), SYSTEM_ERROR_NOT_FOUND);
    CHECK_FALSE(isDiscovering_, SYSTEM_ERROR_INVALID_STATE);
    SCOPE_GUARD ({
        resetDiscoveryState();
    });
    currDiscConnHandle_ = connHandle;
    discSvcCallback_ = callback;
    discSvcContext_ = context;
    if (uuid == nullptr) {
        CHECK_RTL(client_all_primary_srv_discovery(connHandle, clientId_));
    } else {
        discSvcUuid_ = uuid;
        if (uuid->type == BLE_UUID_TYPE_16BIT) {
            CHECK_RTL(client_by_uuid_srv_discovery(connHandle, clientId_, uuid->uuid16));
        } else if (uuid->type == BLE_UUID_TYPE_128BIT) {
            CHECK_RTL(client_by_uuid128_srv_discovery(connHandle, clientId_, (uint8_t*)uuid->uuid128));
        } else {
            return SYSTEM_ERROR_NOT_SUPPORTED;
        }
    }
    isDiscovering_ = true;
    if (os_semaphore_take(discoverySemaphore_, BLE_OPERATION_TIMEOUT_MS, false)) {
        SPARK_ASSERT(false);
        return SYSTEM_ERROR_TIMEOUT;
    }
    return SYSTEM_ERROR_NONE;
}

int BleGatt::discoverCharacteristics(hal_ble_conn_handle_t connHandle, const hal_ble_svc_t* service,
        const hal_ble_uuid_t* uuid, hal_ble_on_disc_char_cb_t callback, void* context) {
    CHECK_TRUE(BleGap::getInstance().valid(connHandle), SYSTEM_ERROR_NOT_FOUND);
    CHECK_TRUE(service, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_FALSE(isDiscovering_, SYSTEM_ERROR_INVALID_STATE);
    SCOPE_GUARD ({
        resetDiscoveryState();
    });
    currDiscConnHandle_ = connHandle;
    discCharCallback_ = callback;
    discCharContext_ = context;
    currDiscService_ = service;
    if (uuid == nullptr) {
        CHECK_RTL(client_all_char_discovery(connHandle, clientId_, service->start_handle, service->end_handle));
    } else {
        if (uuid->type == BLE_UUID_TYPE_16BIT) {
            CHECK_RTL(client_by_uuid_char_discovery(connHandle, clientId_, service->start_handle, service->end_handle, uuid->uuid16));
        } else if (uuid->type == BLE_UUID_TYPE_128BIT) {
            CHECK_RTL(client_by_uuid128_char_discovery(connHandle, clientId_, service->start_handle, service->end_handle, (uint8_t*)uuid->uuid128));
        } else {
            return SYSTEM_ERROR_NOT_SUPPORTED;
        }
    }
    isDiscovering_ = true;
    if (os_semaphore_take(discoverySemaphore_, BLE_OPERATION_TIMEOUT_MS, false)) {
        SPARK_ASSERT(false);
        return SYSTEM_ERROR_TIMEOUT;
    }
    return SYSTEM_ERROR_NONE;
}

int BleGatt::addPublisher(hal_ble_conn_handle_t connHandle, hal_ble_attr_handle_t valueHandle, hal_ble_on_char_evt_cb_t callback, void* context) {
    for (auto& publisher : publishers_) {
        if (publisher.connHandle == connHandle && publisher.valueHandle == valueHandle) {
            publisher.callback = callback;
            publisher.context = context;
            return SYSTEM_ERROR_NONE;
        }
    }
    Publisher pub = {};
    pub.connHandle = connHandle;
    pub.valueHandle = valueHandle;
    pub.callback = callback;
    pub.context = context;
    CHECK_TRUE(publishers_.append(pub), SYSTEM_ERROR_NO_MEMORY);
    return SYSTEM_ERROR_NONE;
}

